{"keras_version": "2.1.5", "backend": "tensorflow", "config": {"layers": [{"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "name": "input_2", "batch_input_shape": [null, 64, 64, 3]}}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"padding": [[3, 3], [3, 3]], "trainable": true, "name": "zero_padding2d_2", "data_format": "channels_last"}}, {"name": "conv0", "class_name": "Conv2D", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "config": {"trainable": true, "name": "conv0", "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1], "padding": "valid", "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_size": [7, 7], "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last"}}, {"name": "bn0", "class_name": "BatchNormalization", "inbound_nodes": [[["conv0", 0, 0, {}]]], "config": {"epsilon": 0.001, "trainable": true, "gamma_constraint": null, "name": "bn0", "momentum": 0.99, "beta_regularizer": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["bn0", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"name": "max_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"trainable": true, "name": "max_pool", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}}, {"name": "flatten_2", "class_name": "Flatten", "inbound_nodes": [[["max_pool", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2"}}, {"name": "fc", "class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "name": "fc", "bias_constraint": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "bias_regularizer": null}}], "output_layers": [["fc", 0, 0]], "name": "HappyModel", "input_layers": [["input_2", 0, 0]]}, "class_name": "Model"}